"""
Chapter : 8 - item : 3 - Ranking
 ส่งมาแล้ว 0 ครั้ง
จงเขียนฟังก์ชั่นในการหา Rank ของ input ที่รับเข้ามา โดย Rank คือการแบ่งเป็นชั้นๆตามข้อมูลของ BST 
โดยจะเริ่มจากค่าที่น้อยกว่าค่าใน BST ที่น้อยที่สุดจะมีค่า Rank = 0 และค่าที่อยู่ตั้งแต่ค่าที่น้อยที่สุดจนถึงตัวถัดไปจะมีค่า Rank +=1 ไปเรื่อยๆ
จนถึงชั้นของตัวสุดท้ายหรือตัวมากสุด เช่น
          5
               4
                    3
     2
1
     -2

จากรูป ค่าที่น้อยที่สุดคือ -2 ดังนั้น rank(-2) จะได้ 1 แต่ rank ของค่าที่น้อยกว่า -2 จะเท่ากับ 0

และ rank(0) จะเท่ากับ 1 ส่วน rank(1) จะเท่ากับ 2 เป็นต้น

Testcase : #1 1
Enter Input : 1 2 5 4 3 -2/4
           5
                4
                     3
      2
 1
      -2
--------------------------------------------------
Rank of 4 : 5

Testcase : #2 2
Enter Input : 7 4 3 1 2 6 9 12 5 11/10
           12
                11
      9
 7
           6
                5
      4
           3
                     2
                1
--------------------------------------------------
Rank of 10 : 8

Testcase : #3 3
Enter Input : 7 4 2 1 9 8 11/5
           11
      9
           8
 7
      4
           2
                1
--------------------------------------------------
Rank of 5 : 3

Testcase : #4 4
Enter Input : 1 2 4 9 8 5 3/0
                9
                     8
                          5
           4
                3
      2
 1
--------------------------------------------------
Rank of 0 : 0

Testcase : #5 5
Enter Input : 1 2 4 9 8 5 3/10
                9
                     8
                          5
           4
                3
      2
 1
--------------------------------------------------
Rank of 10 : 7


"""

